export const sourceQuestionBank = {
  金道源: [
    '在你的记忆中，是否有一类金石让你十分感兴趣？',
    '你惯用的武器是什么？',
    '对于你厌恶之人，你会如何对待？',
  ],
  木道源: [
    '你身边是否有一棵特别的植物？',
    '如果需要你付出自身的代价救治他人，你会怎么做？',
    '生命与死亡对你来说意味着什么？',
  ],
  水道源: [
    '你生活的地方有什么明显的水相关的景观？',
    '你是否有一些一直维系的习惯？',
    '你对于生活中的变化如何看待？',
  ],
  火道源: [
    '你出生的地方是否曾经遭遇一场与火相关的大事件？',
    '你如何看待火会伤人所以要控制火这个事情？',
    '对你来说险境意味着什么？',
  ],
  土道源: [
    '你生活的地方周围是否有巨大的山脉？',
    '如果你需要保护别人，你会用什么方式？',
    '如果有一个理由让你一直坚守你的信条，那么是什么？',
  ],
  雷道源: [
    '是什么让你接触到了天劫的雷？',
    '对你来说，天劫是历练还是抹杀？',
    '你如何面对这瞬息万变的世界？',
  ],
  星宿道源: [
    '你第一次对星空感到好奇是什么时候？',
    '对你来说出生所谓自带的命格代表什么？',
    '对你来说星宿有什么意义？',
  ],
  律法道源: [
    '你是否有一直坚持恪守的守则？',
    '你如何看到撕毁契约的人？',
    '你认为规则的意义是什么？',
  ],
  时空道源: [
    '你是何时感受到时间与空间的？',
    '对你来说时间的流动代表着什么？',
    '对你来说空间的距离代表着什么？',
  ],
  幻梦道源: [
    '你是什么时候感受到梦境的？',
    '对你来说幻觉与现实的界限是什么？',
    '美梦与噩梦有何区别？',
  ],
  古兽道源: [
    '你第一次看到强大的古兽姿态是什么时候？',
    '你为何会与古兽链接？',
    '对你来说古兽的力量意味着什么？',
  ],
  圣灵道源: [
    '你印象最深刻的奇迹是什么？',
    '你对于信仰的看法是？',
    '圣灵对你来说意味着什么？',
  ],
};

export const methodQuestionBank = {
  剑修: [
    '你的剑以怎样的形态展现？',
    '你与你的剑的关系是？',
    '如果你失去了你的剑，你该如何继续修习？',
  ],
  体修: [
    '你的身体上是否有你修习留下的痕迹？',
    '你的身体与他人不同之处在哪？',
    '当你运行法门时，你的身体会有怎样的变化？',
  ],
  魂修: [
    '你的神魂是否让你有一些别人没有的身体特征？',
    '强大的神魂是从何时在你身上出现的？',
    '你神魂感知力对你产生了什么影响？',
  ],
  法修: [
    '是什么样的力量让你可以自如地使用术法？',
    '你身上是否有一些特殊的法术印记？',
    '你最擅长的术法是什么？',
  ],
  丹修: [
    '你炼丹的器具长什么样？',
    '对你来说最想炼出的丹药是什么丹药？',
    '你是为何开始想要去炼丹？',
  ],
  器修: [
    '你最常用的灵器是什么样的？',
    '对你来说灵器与你的关系是？',
    '你有什么毕生都想要打造的灵器吗？',
  ],
  符修: [
    '你的符呈现怎样的形态？',
    '你会用怎样的方式画符？',
    '如果你的符咒被他人滥用，你会怎么做？',
  ],
  阵修: [
    '你为何要去学习阵法？',
    '你是如何接触到阵法的？',
    '你想要完成的阵法是什么样子的？',
  ],
  傀修: [
    '你是何时接触到傀儡的？',
    '你为什么开始制作傀儡？',
    '你有没有一些操控或被控制的经历？',
  ],
  兽修: [
    '你是何时与你的本命灵兽相遇的？',
    '你与你灵兽的一个暗号是？',
    '你与你灵兽之间有没有什么难以忘怀的回忆？',
  ],
};
